RIET/src/InformationRegisters/LocalDistributionSettingsForNonLawsonCompanies/LocalDistributionSettingsForNonLawsonCompanies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LocalDistributionSettingsForNonLawsonCompanies</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>DefaultLegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </resources>
  <resources>
    <name>DefaultCostCenter</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </resources>
  <resources>
    <name>SpecifySegment</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyCostCenter</name>
    <type>
      <types>EnumRef.TypesOfCostCenters</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyProductLine</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyAgreementForRecharge</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SpecifyAcquisitionCost</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ManagementAccountantSubscription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>UseCostCenterFromLegalEntityForNON_PO</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/LocalDistributionSettingsForNonLawsonCompanies/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	   	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.CreatedBy) Тогда
			Запись.CreatedBy = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.CreationDate) Тогда
			Запись.CreationDate = ТекущаяДата();
		КонецЕсли;
		
		Запись.ManagementAccountantSubscription = СокрЛП(Запись.ManagementAccountantSubscription);
		
	КонецЦикла;
	
КонецПроцедуры
